app/controllers/messages_controller.rb

SELECT * FROM `messages` WHERE (subject LIKE '%sda%')
---
	def search
    @messages = Message.find(:all, :conditions => [ "subject LIKE ?", "%#{params[:q]}%"])

SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
---
  def edit
    @message = Message.find(params[:id])

INSERT INTO `messages` (`in_trash`, `created_at`, `body`, `updated_at`, `subject`, `important`, `email`) VALUES(NULL, '2009-04-09 16:54:14', '1', '2009-04-09 16:54:14', '1', NULL, 'asd@asd.ru')
---
  def create
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save

SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
UPDATE `messages` SET `subject` = 'Subject qwe asd Subject qwe asd Subject qwe asd ', `updated_at` = '2009-04-09 17:47:33', `body` = 'Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body Exceptionally long body ' WHERE `id` = 5
---
  def update
    @message = Message.find(params[:id])

		#params[:message]
    respond_to do |format|
      if @message.update_attributes(params[:message])

SELECT * FROM `messages` WHERE (`messages`.`id` = 5)
UPDATE `messages` SET `updated_at` = '2009-04-10 08:06:42', `important` = 1 WHERE `id` = 5
---
	def toggle_favorite
    @message = Message.find(params[:id])
		@message.update_attributes({:important => !@message.important})

SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
DELETE FROM `messages` WHERE `id` = 1
UPDATE `messages` SET `updated_at` = '2009-04-09 18:49:06', `in_trash` = 1 WHERE `id` = 9
---
  def destroy
    @message = Message.find(params[:id])

		if @message.in_trash
			flash[:notice] = 'Message was deleted.'
			@message.destroy
			redirect_target = trash_messages_url
		else
			flash[:notice] = %Q{Message was sent to <a href="#{trash_messages_url}">Trash</a>.}
			@message.update_attributes({:in_trash => true})