app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT * FROM `messages`